{
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attention_k_eq_v": true,
  "bos_token_id": 2,
  "torch_dtype": "bfloat16",
  "enable_moe_block": false,
  "eos_token_id": 1,
  "expert_intermediate_size": null,
  "final_logit_softcapping": 30.0,
  "global_head_dim": 512,
  "head_dim": 256,
  "hidden_activation": "gelu_pytorch_tanh",
  "hidden_size": 5376,
  "hidden_size_per_layer_input": 0,
  "initializer_range": 0.02,
  "intermediate_size": 21504,
  "layer_types": [
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention"
  ],
  "max_position_embeddings": 262144,
  "model_type": "gemma4_text",
  "moe_intermediate_size": null,
  "num_attention_heads": 32,
  "num_experts": null,
  "num_global_key_value_heads": 4,
  "num_hidden_layers": 60,
  "num_key_value_heads": 16,
  "num_kv_shared_layers": 0,
  "pad_token_id": 0,
  "rms_norm_eps": 0.000001,
  "rope_parameters": {
    "full_attention": {
      "partial_rotary_factor": 0.25,
      "rope_theta": 1000000.0,
      "rope_type": "proportional"
    },
    "sliding_attention": {
      "rope_theta": 10000.0,
      "rope_type": "default"
    }
  },
  "sliding_window": 1024,
  "tie_word_embeddings": true,
  "top_k_experts": null,
  "use_bidirectional_attention": "vision",
  "use_cache": true,
  "vocab_size": 262144,
  "vocab_size_per_layer_input": 262144,
  "architectures": [
    "Gemma4ForCausalLM"
  ],
  "transformers_version": "5.8.0.dev0"
}
